<template>
  <v-coruse-card
    :code="code"
    :date="date"
    :title="title"
    :week="week"
  >
    <template slot="card-left">
      <div class=" flex justify-between">
        <a
          class=" text-sm font-semibold"
          href="#1"
        >第一章-書生孟浩</a>
        <a
          class=" text-sm font-semibold"
          href="#2"
        >第二章-靠山宗</a>
        <a
          class=" text-sm font-semibold"
          href="#3"
        >第三章-晉升外宗</a>
        <router-link
          to="/course/week5"
          class=" font-bold text-base text-blue-500"
        >
          回書庫
        </router-link>
      </div>

      <div
        id="1"
        href=""
        class="py-2 font-bold text-lg"
      >
        第一章-書生孟浩
      </div>
      <div class="text-sm font-mono">
        <p class="mb-2">
          趙國是一個小國，如這南贍大地的其他小國一樣，嚮往東土，嚮往大唐，嚮往長安，這是國主的傾慕，也是趙國文生的理想，一如都城內的唐樓，與皇宮齊高，似可以遙望千山萬水外的東土長安。
        </p>
        <p class="mb-2">
          四月的季節，說不出冷，也自然沒有難熬的熱，輕微的風撫過大地，掠過了北漠羌笛，吹過了東土大唐，掀起一些塵土如霧，在黃昏的夕陽下，轉了個彎兒，卷在南域邊緣趙國的大青山，落在了此刻於這青山頂端，坐在那裡的一個文生少年身上。
        </p>
        <p class="mb-2">
          少年有些瘦弱，手中拿著一個葫蘆，穿著一身乾淨的藍色文士長衫，看起來約莫十六七歲的樣子，個字不高，皮膚有些黑，但清澈的雙眼帶著一抹聰穎，只是此刻皺起的眉頭，使得聰穎內斂，神色中多了一抹茫然。
        </p>
        <p class="mb-2">
          “又落榜了……”少年嘆了口氣，他叫孟浩，是這大青山下云傑縣一個普通書生，早年雙親突然失踪，留下家財本就不殷，這幾年讀書不菲，到了如今已貧貧如洗。
        </p>
        <p class="mb-2">
          “考了三年，這三年來整日看那些賢者書籍，已看的幾欲作嘔，莫非科舉真的不是我孟浩未來的路？”孟浩自嘲，低頭看了一眼手中的葫蘆，神色有些黯淡。
        </p>
        <p class="mb-2">
          “當官發財做個有錢人的理想已經越來越遠，更不用說有錢之後去東土大唐……百無一用是書生。”孟浩苦笑，坐在這安靜的山頂，看著手中的葫蘆，神色的茫然越來越深，那茫然裡帶著對未來的恐懼，對自己人生的迷茫，不知曉自己以後能做些什麼，也不知曉未來的路在哪裡。
        </p>
        <p class="mb-2">
          會不會有個貴人看好了自己，是否還有個深閨小姐突然中意自己，又或者若干年後，自己還在不斷的科舉。
        </p>
        <p class="mb-2">
          這些問題沒有答案，對一個十六七歲的少年來說，這樣的迷茫，彷彿化作了一張噬人的大口，將他無形的吞噬，讓他有些害怕。
        </p>
        <p class="mb-2">
          “哪怕是縣城裡的教習先生，每月也只有幾錢銀子，甚至不如王伯的木匠鋪子賺錢，早知如此頭些年不去讀書，和王老伯去學木匠手藝，想來日後總算能解決溫飽，好過如今一無所有。”孟浩沉默。
        </p>
      </div>
      <a
        id="2"
        href=""
        class="py-2 font-bold text-lg"
      >第二章-靠山宗</a>
      <div class="text-sm font-mono">
        <p class="mb-2">
          靠山宗，位於南贍大地南域邊緣的趙國境內，曾是趙國四大宗門之首，就算是整個南域也都頗有其名，可如今沒落，地位不比從前，也沒有了曾經的輝煌，現今於趙國，只能算是末流。
        </p>

        　　<p class="mb-2">
          實際上靠山宗原本也不是叫這個名字，只不過在千年前出了一位轟動整個南域的修士，此人自號靠山老祖，更是強行將宗門之名改為靠山宗，橫行霸道，幾乎搜刮了趙國所有宗門之寶，風光一時無兩。
        </p>

        　　<p class="mb-2">
          可如今千年歲月，物是人非，靠山老祖已失踪四百餘年，若非生死未知，恐有後患，怕是早已被其他宗門吞併，現在的靠山宗已日落西山，再加上趙國資源有限，被其他三宗排擠的就算是要招收雜役，也都需弟子外出綁來，更不用說光明正大的開宗廣收門徒了。
        </p>

        　　<p class="mb-2">
          隨著綠袍男子身後，孟浩行走在靠山宗的山巒小路，四周的一切如桃園之境，奇石怪樹比比皆是，青山綠水間，一處處雲霧內的奢華閣樓，彷彿瓦片都是用玉石鋪成，看的孟浩感嘆連連，只是身邊那小胖子哭喪了一路，讓孟浩覺得有些壞了此地的意境。
        </p>

        　　<p class="mb-2">
          “完了完了，這次真的完了……”
        </p>

        　　<p class="mb-2">
          “我要回家，家裡有大饅頭，家裡有魚肉……”
        </p>

        　　<p class="mb-2">
          “該死的，該死的，我以後應該是繼承家裡的祖田，成為老爺，有個幾房小妾，我不應該在這裡做雜役……”那小胖子一邊哆嗦，一邊哭喪著臉喃喃低語，眼淚在眼圈裡。
        </p>
        　　<p class="mb-2">
          　他嘀咕了一路，直至過了半盞茶的時間，走在前方的綠袍男子傳來冷漠的聲音。
        </p>

        　　<p class="mb-2">
          “再說一句廢話，直接割了你的舌頭。”
        </p>

        　　<p class="mb-2">
          小胖子身子猛地哆嗦了一下，雙眼露出強烈的恐懼，連忙把自己的嘴摀住，身子顫抖的越加劇烈。
        </p>
      </div>
      <a
        id="3"
        href=""
        class="py-2 font-bold text-lg"
      >第三章-晉升外宗</a>
      <div class="text-sm font-mono">
        <p class="mb-2">
          “睡的挺早啊，都给你虎爷爷起来！”随着那两扇房门的呼扇，从外面走进一个穿着杂役衫的魁梧大汉，他凶狠的看了孟浩与还在睡觉的小胖子一眼。
        </p>

        　　<p class="mb-2">
          “你们两个小崽子从今天开始，每人每天多砍十木给我，不然虎爷爷活撕了你们。”大汉狠声开口。
        </p>

        　　<p class="mb-2">
          “见过虎爷，小生……”孟浩赶紧从床上下来，紧张的站在一旁，话还没说完，那大汉眼睛一瞪。
        </p>

        　　<p class="mb-2">
          “小个屁声，觉得虎爷声音大？”
        </p>

        　　<p class="mb-2">
          孟浩只觉一股凶悍之意扑面，看着对方魁梧的身体，迟疑开口：“可……杂役处的师兄只让我们每天每人十木。”
        </p>

        　　<p class="mb-2">
          “多出来的十木，是给老子的。”大汉冷哼一声。
        </p>

        　　<p class="mb-2">
          孟浩沉默，脑子里念头快速转动，刚来这仙人的宗门就被欺负，他有些不甘心，可对方身子魁梧，自己瘦弱明显无法抵抗，正迟疑时他忽然看到桌子角的牙印，想到了小胖子梦游的威武不凡，灵机一动琢磨怎样也得尝试一下，于是立刻向着睡着的小胖子喊了起来。孟浩沉默，脑子里念头快速转动，刚来这仙人的宗门就被欺负，他有些不甘心，可对方身子魁梧，自己瘦弱明显无法抵抗，正迟疑时他忽然看到桌子角的牙印，想到了小胖子梦游的威武不凡，灵机一动琢磨怎样也得尝试一下，于是立刻向着睡着的小胖子喊了起来。
        </p>

        　　<p class="mb-2">
          “胖子，有人抢你馒头，有人抢你娘子！”
        </p>

        　　<p class="mb-2">
          孟浩话语刚落，小胖子猛的坐起，闭着眼睛口中发出大吼，面孔扭曲狰狞。
        </p>
      </div>
    </template>
  </v-coruse-card>
</template>

<script>
import vCoruseCard from '../CourseCard.vue'

const mycode = `
`

export default {
    components: {
        vCoruseCard
    },
    data () {
        return {
            title: '我欲封天',
            date: 'February 25, 2021',
            week: '5',
            code: mycode
        }
    }
}
</script>

<style lang="scss">
</style>
