<template>
  <v-coruse-card
    :code="code"
    :date="date"
    :title="title"
    :week="week"
  >
    <template slot="card-left">
      <div class=" flex justify-between">
        <a
          class=" text-sm font-semibold"
          href="#1"
        >第一章-他叫白小純</a>
        <a
          class=" text-sm font-semibold"
          href="#2"
        >第二章-火灶房</a>
        <a
          class=" text-sm font-semibold"
          href="#3"
        >第三章-6句真言</a>
        <router-link
          to="/course/week5"
          class=" font-bold text-base text-blue-500"
        >
          回書庫
        </router-link>
      </div>

      <div
        id="1"
        href=""
        class="py-2 font-bold text-lg"
      >
        第一章-他叫白小純
      </div>
      <div class="text-sm font-mono">
        <p class="mb-2">
          帽兒山，位於東林山脈中，山下有一個村子，民風淳樸，以耕田為生，與世隔絕。
        </p>
        <p class="mb-2">
          清晨，村莊的大門前，整個村子裡的鄉親，正為一個十五六歲少年送別，
          這少年瘦弱，但卻白白淨淨，看起來很是乖巧，衣著儘管是尋常的青衫，可卻洗的泛白，
          穿在這少年的身上，與他目中的純淨搭配在一起，透出一股子靈動。他叫白小純。
        </p>
        <p class="mb-2">
          “父老鄉親們，我要去修仙了，可我捨不得你們啊。”少年滿臉不捨，原本就乖巧的樣子，此刻看起來更為純樸。
        </p>
        <p class="mb-2">
          四周的鄉親，面面相覷，頓時擺出難捨之色。
        </p>
        <p class="mb-2">
          “小純，你爹娘走的早，你是個……好孩子！！難道你不想長生了麼，成為仙人就可以長生，能活的很久很久，走吧，雛鷹長大，總有飛出去的那一天。
        </p>
        <p class="mb-2">
          ”人群內走出一個頭髮花白的老者，說道好孩子三個字時，他頓了一下。
        </p>
        <p class="mb-2">
          “在外面遇到任何事情，都要堅持下去，走出村子，就不要回來，因為你的路在前方！”老人神色慈祥，拍了拍少年的肩膀。
        </p>
        <p class="mb-2">
          “長生……”白小純身體一震，目中慢慢堅定起來，在老者以及四周鄉親鼓勵的目光下，他重重的點了點頭，深深的看了一眼四周的鄉親，轉身邁著大步，漸漸走出了村子。
        </p>
        <p class="mb-2">
          眼看少年的身影遠去，村中的眾人，一個個都激動起來，目中的難捨剎那就被喜悅代替，那之前滿臉慈祥的老者，此刻也在顫抖，眼中流下淚水。
        </p>
        <p class="mb-2">
          “蒼天有眼，這白鼠狼，他終於……終於走了，是誰告訴他在附近看到仙人的，你為村子立下了大功！”
        </p>
        <p class="mb-2">
          “這白鼠狼終於肯離開了，可憐我家的幾隻雞，就因為這白鼠狼怕雞打鳴，不知用了什麼方法，唆使一群孩子吃雞肉，把全村的雞都給吃的干乾淨淨… …”
        </p>
        <p class="mb-2">
          “今天過年了！”歡呼之聲，立刻在這不大的村子裡，沸騰而起，甚至有人拿出了鑼鼓，高興的敲打起來。
        </p>
      </div>
      <a
        id="2"
        href=""
        class="py-2 font-bold text-lg"
      >第二章-火灶房</a>
      <div class="text-sm font-mono">
        <p class="mb-2">
          靈溪宗，位於東林洲內，屬於通天河的下游支脈所在，立足通天河南北兩岸，至今已有萬年曆史，震懾四方。
        </p>

        　　<p class="mb-2">
          八座雲霧繚繞的驚天山峰，橫在通天河上，其中北岸有四座山峰，南岸三座，至於中間的通天河上，赫然有一座最為磅礴的山峰。
        </p>

        　　<p class="mb-2">
          此山從中段開始就白雪皚皚，竟看不清盡頭，只能看到下半部的山體被掏空，使得金色的河水奔騰而過，如同一座山橋。
        </p>

        　　<p class="mb-2">
          此刻，靈溪宗南岸外，一道長虹疾馳而來，其內中年修士李青候帶著白小純，沒入第三峰下的雜役區域，隱隱還可聽到長虹內白小純的慘叫傳出。
        </p>

        　　<p class="mb-2">
          白小純覺得自己要被嚇死了，一路飛行，他看到了無數大山，好幾次都覺得自己要抓不住對方的大腿。
        </p>

        　　<p class="mb-2">
          眼下面前一花，當清晰時，已到了一處閣樓外，落在了地上後，他雙腿顫抖，看著四周與村子裡完全不同的世界。
        </p>

        　　<p class="mb-2">
          前方的閣樓旁，豎著一塊大石，上面寫著龍飛鳳舞的三個大字。
        </p>
        　　<p class="mb-2">
          雜役處。
        </p>

        　　<p class="mb-2">
          大石旁坐著一個麻臉女子，眼看李青候到來，立刻起身拜見。
        </p>

        　　<p class="mb-2">
          “將此子送火灶房去。”李青候留下一句話，沒有理會白小純，轉身化作長虹遠去。
        </p>
      </div>
      <a
        id="3"
        href=""
        class="py-2 font-bold text-lg"
      >第三章-6句真言</a>
      <div class="text-sm font-mono">
        <p class="mb-2">
          白小純這麼一伸頭，面黃肌瘦的青年立刻就看到，目光落在白小純的臉上，氣勢洶洶。
        </p>

        　　<p class="mb-2">
          “就是你頂替了我的名額！”
        </p>

        　　<p class="mb-2">
          “不是我！”白小純縮頭已來不及了，趕緊裝出一副無辜的樣子。
        </p>

        　　<p class="mb-2">
          “胡說，你這麼瘦，頭這麼小，分明就是新來的！”許寶財握緊了拳頭，怒視白小純。
        </p>

        　　<p class="mb-2">
          “這真的和我沒關係啊。”白小純眼看對方的怒意似要炸了一樣，覺得委屈，小聲說道。
        </p>

        　　<p class="mb-2">
          “我不管，三天之後，宗門南坡，你我決一死戰，若你贏了，這口氣許某忍了，若你輸了，這個名額就歸我了。”許寶財大聲開口，從懷里扔出一張血書，直接扔在了白小純面前的窗台上，上面密密麻麻寫著無數的血色的殺字。
        </p>

        　　<p class="mb-2">
          白小純看著那張血書，看著上面那麼多血色的殺字，只覺得殺氣撲面，心底發毛，尤其是聽到對方說要決一死戰，更是倒吸口氣。
        </p>

        　　<p class="mb-2">
          “師兄，多大點事啊，用自己的血，寫了這麼多個字……得多疼啊。”
        </p>

        　　<p class="mb-2">
          “多大的事？啊，我這些年省吃儉用，攢了七年的靈石，七年啊，整整七年！！孝敬給執事，這才換來一個進入火灶房的資格，卻被你插了一腳，我與你勢不兩立，三天后，不是你死就是我活！”許寶財歇斯底里，咬牙切齒。
        </p>
      </div>
    </template>
  </v-coruse-card>
</template>

<script>
import vCoruseCard from '../CourseCard.vue'

const mycode = `<!--Bookmark書籤-->
<a href="#1">第一章-他叫白小純</a>
<a href="#2">第二章-火灶房</a>
<a href="#3">第三章-6句真言</a>

<h3 id="1">第一章-他叫白小純</h3>
<h3 id="2">第二章-火灶房</h3>
<h3 id="3">第三章-6句真言</h3>
`

export default {
    components: {
        vCoruseCard
    },
    data () {
        return {
            title: '一念永恆',
            date: 'February 25, 2021',
            week: '5',
            code: mycode
        }
    }
}
</script>

<style lang="scss">
</style>
